In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [20]:
data1 = Series([1,2])
data1

0    1
1    2
dtype: int64

In [21]:
ser1 = Series(np.arange(5,19,2))
ser1

0     5
1     7
2     9
3    11
4    13
5    15
6    17
dtype: int32

In [69]:
ser2 = Series(np.random.random(50))
ser2

0    0.145777
1    0.782386
2    0.741790
3    0.674350
4    0.807096
dtype: float64

In [77]:
df = DataFrame(np.random.rand(5).reshape((5,1)),index=list('01234'),columns=list('1'))
df

          1
0  0.746634
1  0.715360
2  0.696636
3  0.050722
4  0.969587

In [78]:
ser2 = (ser2)
ser2

          0
0  0.145777
1  0.782386
2  0.741790
3  0.674350
4  0.807096

In [72]:
df[]

    0   0
0 NaN NaN
1 NaN NaN
2 NaN NaN
3 NaN NaN
4 NaN NaN
0 NaN NaN
1 NaN NaN
2 NaN NaN
3 NaN NaN
4 NaN NaN